In [4]:
import numpy as np 
import pandas as pd 
import os
import matplotlib.pyplot as plt

os.chdir("/Users/jacobrichards/Desktop/Personal_save/Python/Marketing_Prediction_Python_files")

data = pd.read_csv("data.csv", na_values=["", "NA"])

display(data.head())

   id  age      dist       income gender marital_status  target
0   1   73  4.371654    90-99,999      M              S       1
1   2   89  1.582733  100-149,999      M            NaN       1
2   3   85  1.223810    10-19,999      F              S       1
3   4   76  2.962427    90-99,999      M              M       1
4   5   76  2.594408    10-19,999      M              S       1

In [5]:
import pandas as pd
import numpy as np

# Replace missing or empty values in columns 4, 5, 6 with "unknown"
data.iloc[:, [3, 4, 5]] = data.iloc[:, [3, 4, 5]].applymap(lambda x: "unknown" if pd.isna(x) or x == "" else x)

# Replace income with appropriate midpoints or custom values
income_mapping = {
    "unknown": 55000,              # replacing unknown with the median income level
    "Under $10k": 5000,            # midpoint of "Under $10k"
    "10-19,999": 15000,            # midpoint of "10-19,999"
    "20-29,999": 25000,            # midpoint of "20-29,999"
    "30-39,999": 35000,            # midpoint of "30-39,999"
    "40-49,999": 45000,            # midpoint of "40-49,999"
    "50-59,999": 55000,            # midpoint of "50-59,999"
    "60-69,999": 65000,            # midpoint of "60-69,999"
    "70-79,999": 75000,            # midpoint of "70-79,999"
    "80-89,999": 85000,            # midpoint of "80-89,999"
    "90-99,999": 95000,            # midpoint of "90-99,999"
    "100-149,999": 125000,         # midpoint of "100-149,999"
    "150 - 174,999": 162500,       # midpoint of "150 - 174,999"
    "175 - 199,999": 187500,       # midpoint of "175 - 199,999"
    "200 - 249,999": 225000,       # midpoint of "200 - 249,999"
    "250k+": 250000               # custom value for "250k+"
}
data["income"] = data["income"].map(income_mapping).astype(int)

# Replace gender with 1 for male, 0 for female, and 0 for unknown
gender_mapping = {"M": 1, "F": 0, "unknown": 0}
data["gender"] = data["gender"].map(gender_mapping).astype(int)

# Replace marital_status with 1 for married, 0 for single, and 1 for unknown
marital_status_mapping = {"M": 1, "S": 0, "unknown": 1}
data["marital_status"] = data["marital_status"].map(marital_status_mapping).astype(int)

# Convert target to categorical values (0 or 1)
data["target"] = data["target"].astype(int)

# Convert distance (dist) column to integer
data["dist"] = data["dist"].astype(int)

display(data.head())

/var/folders/2y/cbtx_pl154qczd091zb0d4z40000gn/T/ipykernel_35734/2513319986.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  data.iloc[:, [3, 4, 5]] = data.iloc[:, [3, 4, 5]].applymap(lambda x: "unknown" if pd.isna(x) or x == "" else x)

   id  age  dist  income  gender  marital_status  target
0   1   73     4   95000       1               0       1
1   2   89     1  125000       1               1       1
2   3   85     1   15000       0               0       1
3   4   76     2   95000       1               1       1
4   5   76     2   15000       1               0       1